/*
  从2014年7月开始恢复股票池的发布。
*/

var historyArr = new Array (
/*  达成日期     股票代码  股票名称  初始价格  目标价格  达成价  累计涨幅%  行业分类   关注日期     总计天数  */
  ["2015-04-08", "300113", "顺网科技", "39.81", "50.00", "55.74", "40.02", "计算机", "2015-04-01", "8"]
);

var indexArr = new Array("0000001","1399001","1399006","1399300");

var hqArr = new Array(
/* 股票代码   所属行业     关注日期   前日收盘价   目标价    评级 */
  ["0603766", "非汽车交运", "2015-10-11", "17.14",  "21.00",  "买入"],
  ["1000672", "建筑材料", "2015-10-7", "7.91",  "12.10",  "增持"]

);

